# `read_csv` dtype parameter

Change dtype of a column while reading a dataset

In [1]:
import pandas as pd

## 1. Basic read

In [2]:
df_student = pd.read_csv("./datasets/students_score_no_index.csv")

df_student

       Name  Score Grades
0      Paul     98     AA
1     Aaron     89     AB
2    Krista     99     AA
3  Veronica     87     AB
4    Paxton     90     AC
5   Madison     83     BA
6    Aurora     82     BB

## 2. Using dtype parameter

In [4]:
df_student_f32 = pd.read_csv("./datasets/students_score_no_index.csv", dtype={'Score' : 'float32'})

df_student_f32

       Name  Score Grades
0      Paul   98.0     AA
1     Aaron   89.0     AB
2    Krista   99.0     AA
3  Veronica   87.0     AB
4    Paxton   90.0     AC
5   Madison   83.0     BA
6    Aurora   82.0     BB

## 3. Multiple conversion

In [5]:
df_student_mult = pd.read_csv("./datasets/students_score_exp.csv", dtype={'Score' : 'float32', 'Queue' : 'float64', 'Order' : 'int32'})

df_student_mult

       Name  Score Grades  Queue  Order
0      Paul   98.0     AA    1.0     11
1     Aaron   89.0     AB    2.0     12
2    Krista   99.0     AA    3.0     13
3  Veronica   87.0     AB    4.0     14
4    Paxton   90.0     AC    5.0     15
5   Madison   83.0     BA    6.0     16
6    Aurora   82.0     BB    7.0     17